[Killed] ArithmeticOperator
src/operacoes.js:4:30
 // src/operacoes.js
 
 // === Bloco 1: Operações Básicas (1-10) ===
-function soma(a, b) { return a + b; }
+function soma(a, b) { return a - b; }
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 1. deve somar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] BlockStatement
src/operacoes.js:4:21
 // src/operacoes.js
 
 // === Bloco 1: Operações Básicas (1-10) ===
-function soma(a, b) { return a + b; }
+function soma(a, b) {}
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 1. deve somar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:5:35
 
 // === Bloco 1: Operações Básicas (1-10) ===
 function soma(a, b) { return a + b; }
-function subtracao(a, b) { return a - b; }
+function subtracao(a, b) { return a + b; }
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 2. deve subtrair dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 7

[Killed] BlockStatement
src/operacoes.js:5:26
 
 // === Bloco 1: Operações Básicas (1-10) ===
 function soma(a, b) { return a + b; }
-function subtracao(a, b) { return a - b; }
+function subtracao(a, b) {}
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 2. deve subtrair dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:6:39
 // === Bloco 1: Operações Básicas (1-10) ===
 function soma(a, b) { return a + b; }
 function subtracao(a, b) { return a - b; }
-function multiplicacao(a, b) { return a * b; }
+function multiplicacao(a, b) { return a / b; }
 function divisao(a, b) {
   if (b === 0) throw new Error('Divisão por zero não é permitida.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 3. deve multiplicar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 0.75

[Killed] BlockStatement
src/operacoes.js:6:30
 // === Bloco 1: Operações Básicas (1-10) ===
 function soma(a, b) { return a + b; }
 function subtracao(a, b) { return a - b; }
-function multiplicacao(a, b) { return a * b; }
+function multiplicacao(a, b) {}
 function divisao(a, b) {
   if (b === 0) throw new Error('Divisão por zero não é permitida.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 3. deve multiplicar dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] BlockStatement
src/operacoes.js:7:24
 function soma(a, b) { return a + b; }
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
-function divisao(a, b) {
-  if (b === 0) throw new Error('Divisão por zero não é permitida.');
-  return a / b;
-}
+function divisao(a, b) {}
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:8:7
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
-  if (b === 0) throw new Error('Divisão por zero não é permitida.');
+  if (true) throw new Error('Divisão por zero não é permitida.');
   return a / b;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: Divisão por zero não é permitida.

[Killed] ConditionalExpression
src/operacoes.js:8:7
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
-  if (b === 0) throw new Error('Divisão por zero não é permitida.');
+  if (false) throw new Error('Divisão por zero não é permitida.');
   return a / b;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ArithmeticOperator
src/operacoes.js:9:10
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
   if (b === 0) throw new Error('Divisão por zero não é permitida.');
-  return a / b;
+  return a * b;
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 4. deve dividir e lançar erro para divisão por zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 20

[Killed] BlockStatement
src/operacoes.js:11:35
   if (b === 0) throw new Error('Divisão por zero não é permitida.');
   return a / b;
 }
-function potencia(base, expoente) { return Math.pow(base, expoente); }
+function potencia(base, expoente) {}
 function raizQuadrada(n) {
   if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 5. deve calcular a potência com expoente positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] BlockStatement
src/operacoes.js:12:26
   return a / b;
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
-function raizQuadrada(n) {
-  if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
-  return Math.sqrt(n);
-}
+function raizQuadrada(n) {}
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas raizQuadrada deve lançar erro apenas para números negativos, não para zero
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] ConditionalExpression
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (false) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes raizQuadrada deve lançar erro para número negativo
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/operacoes.js:16:43
   if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
-function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
+function restoDivisao(dividendo, divisor) {}
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:16:52
   if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
-function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
+function restoDivisao(dividendo, divisor) { return dividendo * divisor; }
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 7. deve retornar o resto da divisão
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 30

[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:18:7
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+  if (true) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: Fatorial não é definido para números negativos.

[Killed] ConditionalExpression
src/operacoes.js:18:7
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+  if (false) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes fatorial deve lançar erro para número negativo
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/operacoes.js:19:7
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  if (n === 0 || n === 1) return 1;
+  if (true) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:19:18
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  if (n === 0 || n === 1) return 1;
+  if (n === 0 || n !== 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] EqualityOperator
src/operacoes.js:21:19
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
+  for (let i = 2; i < n; i++) { resultado *= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 6

[Killed] AssignmentOperator
src/operacoes.js:21:34
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
   if (n === 0 || n === 1) return 1;
   let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
+  for (let i = 2; i <= n; i++) { resultado /= i; }
   return resultado;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] BlockStatement
src/operacoes.js:24:30
   for (let i = 2; i <= n; i++) { resultado *= i; }
   return resultado;
 }
-function mediaArray(numeros) {
-  if (numeros.length === 0) return 0;
-  return somaArray(numeros) / numeros.length;
-}
+function mediaArray(numeros) {}
 function somaArray(numeros) {
   return numeros.reduce((acc, val) => acc + val, 0);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:25:7
   return resultado;
 }
 function mediaArray(numeros) {
-  if (numeros.length === 0) return 0;
+  if (numeros.length !== 0) return 0;
   return somaArray(numeros) / numeros.length;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:25:7
   return resultado;
 }
 function mediaArray(numeros) {
-  if (numeros.length === 0) return 0;
+  if (true) return 0;
   return somaArray(numeros) / numeros.length;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 0

[Killed] ArithmeticOperator
src/operacoes.js:26:10
 }
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
-  return somaArray(numeros) / numeros.length;
+  return somaArray(numeros) * numeros.length;
 }
 function somaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 180

[Killed] BlockStatement
src/operacoes.js:28:29
   if (numeros.length === 0) return 0;
   return somaArray(numeros) / numeros.length;
 }
-function somaArray(numeros) {
-  return numeros.reduce((acc, val) => acc + val, 0);
-}
+function somaArray(numeros) {}
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: NaN

[Killed] ArrowFunction
src/operacoes.js:29:25
   return somaArray(numeros) / numeros.length;
 }
 function somaArray(numeros) {
-  return numeros.reduce((acc, val) => acc + val, 0);
+  return numeros.reduce(() => undefined, 0);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: NaN

[Killed] ArithmeticOperator
src/operacoes.js:29:39
   return somaArray(numeros) / numeros.length;
 }
 function somaArray(numeros) {
-  return numeros.reduce((acc, val) => acc + val, 0);
+  return numeros.reduce((acc, val) => acc - val, 0);
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 9. deve calcular a média de um array com múltiplos elementos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: -20

[Killed] BlockStatement
src/operacoes.js:33:31
 }
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
-function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
-  return Math.max(...numeros);
-}
+function maximoArray(numeros) {}
 function minimoArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:34:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+  if (numeros.length !== 0) throw new Error('Array vazio не possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: Array vazio не possui valor máximo.

[Killed] ConditionalExpression
src/operacoes.js:34:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+  if (false) throw new Error('Array vazio не possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes maximoArray deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] MethodExpression
src/operacoes.js:35:10
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
-  return Math.max(...numeros);
+  return Math.min(...numeros);
 }
 function minimoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 11. deve encontrar o valor máximo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 1

[Killed] BlockStatement
src/operacoes.js:37:31
   if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
   return Math.max(...numeros);
 }
-function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
-  return Math.min(...numeros);
-}
+function minimoArray(numeros) {}
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:38:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
+  if (numeros.length !== 0) throw new Error('Array vazio не possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: Array vazio не possui valor mínimo.

[Killed] ConditionalExpression
src/operacoes.js:38:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
+  if (false) throw new Error('Array vazio не possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes minimoArray deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] MethodExpression
src/operacoes.js:39:10
 }
 function minimoArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
-  return Math.min(...numeros);
+  return Math.max(...numeros);
 }
 function valorAbsoluto(n) { return Math.abs(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100

[Killed] BlockStatement
src/operacoes.js:41:27
   if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
   return Math.min(...numeros);
 }
-function valorAbsoluto(n) { return Math.abs(n); }
+function valorAbsoluto(n) {}
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 13. deve retornar o valor absoluto de um número negativo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:42:24
   return Math.min(...numeros);
 }
 function valorAbsoluto(n) { return Math.abs(n); }
-function arredondar(n) { return Math.round(n); }
+function arredondar(n) {}
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 14. deve arredondar um número para cima
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:43:28
 }
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
-function isPar(n) { return n % 2 === 0; }
+function isPar(n) { return false; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:43:19
 }
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
-function isPar(n) { return n % 2 === 0; }
+function isPar(n) {}
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 15. deve retornar true para um número par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:44:30
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
-function isImpar(n) { return n % 2 !== 0; }
+function isImpar(n) { return n * 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas isImpar deve retornar false para números pares
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:44:30
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
-function isImpar(n) { return n % 2 !== 0; }
+function isImpar(n) { return n % 2 === 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 16. deve retornar true para um número ímpar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/operacoes.js:45:58
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
-function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
+function calcularPorcentagem(percentual, valor) { return valor * percentual * 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: 1000000

[Killed] BlockStatement
src/operacoes.js:45:49
 function arredondar(n) { return Math.round(n); }
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
-function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
+function calcularPorcentagem(percentual, valor) {}
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 17. deve calcular uma porcentagem simples
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 100
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:46:71
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
-function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
+function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual * 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 100100

Expected precision:    2
Expected difference: < 0.005
Received difference:   99990

[Killed] ArithmeticOperator
src/operacoes.js:46:58
 function isPar(n) { return n % 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
-function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
+function aumentarPorcentagem(valor, percentual) { return valor / (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
 function inverterSinal(n) { return -n; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 18. deve aumentar um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 110
Received: 90.9090909090909

Expected precision:    2
Expected difference: < 0.005
Received difference:   19.090909090909093

[Killed] ArithmeticOperator
src/operacoes.js:47:58
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
-function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
+function diminuirPorcentagem(valor, percentual) { return valor / (1 - percentual / 100); }
 function inverterSinal(n) { return -n; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: 111.11111111111111

Expected precision:    2
Expected difference: < 0.005
Received difference:   21.111111111111114

[Killed] ArithmeticOperator
src/operacoes.js:47:71
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
-function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
+function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual * 100); }
 function inverterSinal(n) { return -n; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 19. deve diminuir um valor em uma porcentagem
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 90
Received: -99900

Expected precision:    2
Expected difference: < 0.005
Received difference:   99990
