[Killed] BlockStatement
src/operacoes.js:48:27
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
-function inverterSinal(n) { return -n; }
+function inverterSinal(n) {}
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: undefined

[Killed] UnaryOperator
src/operacoes.js:48:36
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
 function aumentarPorcentagem(valor, percentual) { return valor * (1 + percentual / 100); }
 function diminuirPorcentagem(valor, percentual) { return valor * (1 - percentual / 100); }
-function inverterSinal(n) { return -n; }
+function inverterSinal(n) { return +n; }
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 20. deve inverter o sinal de um número positivo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -42
Received: 42

[Killed] BlockStatement
src/operacoes.js:51:26
 function inverterSinal(n) { return -n; }
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
-function seno(anguloRad) { return Math.sin(anguloRad); }
+function seno(anguloRad) {}
 function cosseno(anguloRad) { return Math.cos(anguloRad); }
 function tangente(anguloRad) { return Math.tan(anguloRad); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 21. deve calcular o seno de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/operacoes.js:52:29
 
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
 function seno(anguloRad) { return Math.sin(anguloRad); }
-function cosseno(anguloRad) { return Math.cos(anguloRad); }
+function cosseno(anguloRad) {}
 function tangente(anguloRad) { return Math.tan(anguloRad); }
 function logaritmoNatural(n) { return Math.log(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 22. deve calcular o cosseno de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/operacoes.js:53:30
 // === Bloco 3: Funções Trigonométricas e Logarítmicas (21-30) ===
 function seno(anguloRad) { return Math.sin(anguloRad); }
 function cosseno(anguloRad) { return Math.cos(anguloRad); }
-function tangente(anguloRad) { return Math.tan(anguloRad); }
+function tangente(anguloRad) {}
 function logaritmoNatural(n) { return Math.log(n); }
 function logaritmoBase10(n) { return Math.log10(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 23. deve calcular a tangente de 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/operacoes.js:54:30
 function seno(anguloRad) { return Math.sin(anguloRad); }
 function cosseno(anguloRad) { return Math.cos(anguloRad); }
 function tangente(anguloRad) { return Math.tan(anguloRad); }
-function logaritmoNatural(n) { return Math.log(n); }
+function logaritmoNatural(n) {}
 function logaritmoBase10(n) { return Math.log10(n); }
 function arredondarParaBaixo(n) { return Math.floor(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 24. deve calcular o logaritmo natural de Euler
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/operacoes.js:55:29
 function cosseno(anguloRad) { return Math.cos(anguloRad); }
 function tangente(anguloRad) { return Math.tan(anguloRad); }
 function logaritmoNatural(n) { return Math.log(n); }
-function logaritmoBase10(n) { return Math.log10(n); }
+function logaritmoBase10(n) {}
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 25. deve calcular o logaritmo na base 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/operacoes.js:56:33
 function tangente(anguloRad) { return Math.tan(anguloRad); }
 function logaritmoNatural(n) { return Math.log(n); }
 function logaritmoBase10(n) { return Math.log10(n); }
-function arredondarParaBaixo(n) { return Math.floor(n); }
+function arredondarParaBaixo(n) {}
 function arredondarParaCima(n) { return Math.ceil(n); }
 function hipotenusa(catetoA, catetoB) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 26. deve arredondar para baixo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] BlockStatement
src/operacoes.js:57:32
 function logaritmoNatural(n) { return Math.log(n); }
 function logaritmoBase10(n) { return Math.log10(n); }
 function arredondarParaBaixo(n) { return Math.floor(n); }
-function arredondarParaCima(n) { return Math.ceil(n); }
+function arredondarParaCima(n) {}
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 27. deve arredondar para cima
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/operacoes.js:58:39
 function logaritmoBase10(n) { return Math.log10(n); }
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
-function hipotenusa(catetoA, catetoB) {
-  return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
-}
+function hipotenusa(catetoA, catetoB) {}
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 28. deve calcular a hipotenusa de um triângulo retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:59:20
 function arredondarParaBaixo(n) { return Math.floor(n); }
 function arredondarParaCima(n) { return Math.ceil(n); }
 function hipotenusa(catetoA, catetoB) {
-  return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
+  return Math.sqrt(Math.pow(catetoA, 2) - Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 28. deve calcular a hipotenusa de um triângulo retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: NaN

[Killed] ArithmeticOperator
src/operacoes.js:61:53
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
-function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
+function grausParaRadianos(graus) { return graus * (Math.PI * 180); }
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 3.141592653589793
Received: 101787.6019763093

Expected precision:    2
Expected difference: < 0.005
Received difference:   101784.46038365572

[Killed] BlockStatement
src/operacoes.js:61:35
 function hipotenusa(catetoA, catetoB) {
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
-function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
+function grausParaRadianos(graus) {}
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 29. deve converter graus para radianos
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] BlockStatement
src/operacoes.js:62:38
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
-function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
+function radianosParaGraus(radianos) {}
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:62:59
   return Math.sqrt(Math.pow(catetoA, 2) + Math.pow(catetoB, 2));
 }
 function grausParaRadianos(graus) { return graus * (Math.PI / 180); }
-function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
+function radianosParaGraus(radianos) { return radianos * (180 * Math.PI); }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 30. deve converter radianos para graus
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 180
Received: 1776.5287921960844

Expected precision:    2
Expected difference: < 0.005
Received difference:   1596.5287921960844

[Killed] BlockStatement
src/operacoes.js:65:20
 function radianosParaGraus(radianos) { return radianos * (180 / Math.PI); }
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
-function mdc(a, b) { // Máximo Divisor Comum
-  while(b) { [a, b] = [b, a % b]; }
-  return a;
-}
+function mdc(a, b) {}
 function mmc(a, b) { // Mínimo Múltiplo Comum
   return (a * b) / mdc(a, b);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:66:9
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { // Máximo Divisor Comum
-  while(b) { [a, b] = [b, a % b]; }
+  while(false) { [a, b] = [b, a % b]; }
   return a;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 31. deve calcular o MDC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Timeout] BlockStatement
src/operacoes.js:66:12
 
 // === Bloco 4: Teoria dos Números e Sequências (31-40) ===
 function mdc(a, b) { // Máximo Divisor Comum
-  while(b) { [a, b] = [b, a % b]; }
+  while(b) {}
   return a;
 }

[Killed] BlockStatement
src/operacoes.js:69:20
   while(b) { [a, b] = [b, a % b]; }
   return a;
 }
-function mmc(a, b) { // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
-}
+function mmc(a, b) {}
 function isPrimo(n) {
   if (n <= 1) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:70:11
   return a;
 }
 function mmc(a, b) { // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
+  return (a / b) / mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0.4

[Killed] ArithmeticOperator
src/operacoes.js:70:10
   return a;
 }
 function mmc(a, b) { // Mínimo Múltiplo Comum
-  return (a * b) / mdc(a, b);
+  return a * b * mdc(a, b);
 }
 function isPrimo(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 32. deve calcular o MMC de dois números
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 250

[Killed] BlockStatement
src/operacoes.js:72:21
 function mmc(a, b) { // Mínimo Múltiplo Comum
   return (a * b) / mdc(a, b);
 }
-function isPrimo(n) {
-  if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
-  }
-  return true;
-}
+function isPrimo(n) {}
 function fibonacci(n) { // Retorna o n-ésimo termo
   if (n <= 1) return n;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:73:7
   return (a * b) / mdc(a, b);
 }
 function isPrimo(n) {
-  if (n <= 1) return false;
+  if (n > 1) return false;
   for (let i = 2; i < n; i++) {
     if (n % i === 0) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:73:7
   return (a * b) / mdc(a, b);
 }
 function isPrimo(n) {
-  if (n <= 1) return false;
+  if (false) return false;
   for (let i = 2; i < n; i++) {
     if (n % i === 0) return false;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isPrimo deve retornar false para 0 e 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/operacoes.js:74:19
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
+  for (let i = 2; i >= n; i++) {
     if (n % i === 0) return false;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isPrimo deve retornar false para número composto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
src/operacoes.js:74:26
 }
 function isPrimo(n) {
   if (n <= 1) return false;
-  for (let i = 2; i < n; i++) {
+  for (let i = 2; i < n; i--) {
     if (n % i === 0) return false;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:75:9
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
+    if (true) return false;
   }
   return true;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 33. deve verificar que um número é primo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/operacoes.js:75:29
 function isPrimo(n) {
   if (n <= 1) return false;
   for (let i = 2; i < n; i++) {
-    if (n % i === 0) return false;
+    if (n % i === 0) return true;
   }
   return true;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isPrimo deve retornar false para número composto
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/operacoes.js:79:23
   }
   return true;
 }
-function fibonacci(n) { // Retorna o n-ésimo termo
-  if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
-}
+function fibonacci(n) {}
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:80:7
   return true;
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (n < 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: -55

[Killed] ConditionalExpression
src/operacoes.js:80:7
   return true;
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
-  if (n <= 1) return n;
+  if (true) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: 10

[Killed] ArithmeticOperator
src/operacoes.js:81:10
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
   if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
+  return fibonacci(n - 1) - fibonacci(n - 2);
 }
 function produtoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 55
Received: -1

[Killed] ArithmeticOperator
src/operacoes.js:81:20
 }
 function fibonacci(n) { // Retorna o n-ésimo termo
   if (n <= 1) return n;
-  return fibonacci(n - 1) + fibonacci(n - 2);
+  return fibonacci(n + 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 34. deve calcular o 10º termo de Fibonacci
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
src/operacoes.js:83:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 function clamp(valor, min, max) {
   if (valor < min) return min;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:84:7
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
+  if (numeros.length !== 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:84:7
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
 function produtoArray(numeros) {
-  if (numeros.length === 0) return 1;
+  if (true) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ArrowFunction
src/operacoes.js:85:25
 }
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce(() => undefined, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:85:39
 }
 function produtoArray(numeros) {
   if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce((acc, val) => acc / val, 1);
 }
 function clamp(valor, min, max) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 35. deve calcular o produto de um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 0.041666666666666664

[Killed] BlockStatement
src/operacoes.js:87:33
   if (numeros.length === 0) return 1;
   return numeros.reduce((acc, val) => acc * val, 1);
 }
-function clamp(valor, min, max) {
-  if (valor < min) return min;
-  if (valor > max) return max;
-  return valor;
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (valor < min) return min;
+  if (false) return min;
   if (valor > max) return max;
   return valor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes clamp deve retornar o valor mínimo se abaixo do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -10

[Killed] ConditionalExpression
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (valor < min) return min;
+  if (true) return min;
   if (valor > max) return max;
   return valor;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/operacoes.js:89:7
 }
 function clamp(valor, min, max) {
   if (valor < min) return min;
-  if (valor > max) return max;
+  if (false) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes clamp deve retornar o valor máximo se acima do intervalo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] ConditionalExpression
src/operacoes.js:89:7
 }
 function clamp(valor, min, max) {
   if (valor < min) return min;
-  if (valor > max) return max;
+  if (true) return max;
   return valor;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 36. deve manter um valor dentro de um intervalo (clamp)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 10

[Killed] EqualityOperator
src/operacoes.js:92:51
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+function isDivisivel(dividendo, divisor) { return dividendo % divisor !== 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 37. deve verificar se um número é divisível por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/operacoes.js:92:51
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+function isDivisivel(dividendo, divisor) { return true; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isDivisivel retorna false quando não for divisível
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
src/operacoes.js:93:51
   return valor;
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
-function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+function celsiusParaFahrenheit(celsius) { return (celsius * 9 * 5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas celsiusParaFahrenheit deve converter corretamente
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 212
Received: 4532

Expected precision:    2
Expected difference: < 0.005
Received difference:   4320

[Killed] BlockStatement
src/operacoes.js:93:41
   return valor;
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
-function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+function celsiusParaFahrenheit(celsius) {}
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 38. deve converter Celsius para Fahrenheit
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:94:54
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
-function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit + 32) * 5/9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 39. deve converter Fahrenheit para Celsius
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 35.55555555555556

[Killed] ArithmeticOperator
src/operacoes.js:94:53
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
-function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5 * 9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas fahrenheitParaCelsius deve converter corretamente
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 100
Received: 8100

Expected precision:    2
Expected difference: < 0.005
Received difference:   8000

[Killed] BlockStatement
src/operacoes.js:95:21
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
-function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
-  return 1 / n;
-}
+function inverso(n) {}
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:96:7
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
+  if (n !== 0) throw new Error('Não é possível inverter o número zero.');
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: Não é possível inverter o número zero.

[Killed] ConditionalExpression
src/operacoes.js:96:7
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
+  if (false) throw new Error('Não é possível inverter o número zero.');
   return 1 / n;
 }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes inverso deve lançar erro para 0
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ArithmeticOperator
src/operacoes.js:97:10
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
   if (n === 0) throw new Error('Não é possível inverter o número zero.');
-  return 1 / n;
+  return 1 * n;
 }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 40. deve calcular o inverso de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.25
Received: 4

[Killed] ArithmeticOperator
src/operacoes.js:101:37
 }
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
-function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
+function areaCirculo(raio) { return Math.PI / Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 41. deve calcular a área de um círculo
statusReason: Error: expect(received).toBeCloseTo(expected)

Expected: 314.159
Received: 0.031415926535897934

Expected precision:    2
Expected difference: < 0.005
Received difference:   314.1275840734641
