[Killed] BlockStatement
src/operacoes.js:101:28
 }
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
-function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
+function areaCirculo(raio) {}
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 41. deve calcular a área de um círculo
statusReason: Error: expect(received).toBeCloseTo(expected)

Matcher error: received value must be a number

Received has value: undefined

[Killed] ArithmeticOperator
src/operacoes.js:102:47
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
-function areaRetangulo(base, altura) { return base * altura; }
+function areaRetangulo(base, altura) { return base / altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 42. deve calcular a área de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 1.25

[Killed] BlockStatement
src/operacoes.js:102:38
 
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
-function areaRetangulo(base, altura) { return base * altura; }
+function areaRetangulo(base, altura) {}
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 42. deve calcular a área de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:103:57
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
-function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
+function perimetroRetangulo(base, altura) { return 2 * (base - altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: 2

[Killed] BlockStatement
src/operacoes.js:103:43
 // === Bloco 5: Geometria e Lógica de Comparação (41-50) ===
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
-function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
+function perimetroRetangulo(base, altura) {}
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 43. deve calcular o perímetro de um retângulo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18
Received: undefined

[Killed] BlockStatement
src/operacoes.js:104:27
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) {}
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:104:36
 function areaCirculo(raio) { return Math.PI * Math.pow(raio, 2); }
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
-function isMaiorQue(a, b) { return a > b; }
+function isMaiorQue(a, b) { return a <= b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 44. deve verificar se um número é maior que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/operacoes.js:105:27
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
-function isMenorQue(a, b) { return a < b; }
+function isMenorQue(a, b) {}
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 45. deve verificar se um número é menor que outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:105:36
 function areaRetangulo(base, altura) { return base * altura; }
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
-function isMenorQue(a, b) { return a < b; }
+function isMenorQue(a, b) { return a <= b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isMenorQue retorna false quando valores são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/operacoes.js:106:24
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
-function isEqual(a, b) { return a === b; }
+function isEqual(a, b) {}
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 46. deve verificar se dois números são iguais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/operacoes.js:106:33
 function perimetroRetangulo(base, altura) { return 2 * (base + altura); }
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
-function isEqual(a, b) { return a === b; }
+function isEqual(a, b) { return true; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes isEqual deve retornar false para números diferentes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/operacoes.js:107:32
 function isMaiorQue(a, b) { return a > b; }
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
-function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
-  const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
-  }
-  return sorted[mid];
-}
+function medianaArray(numeros) {}
 function dobro(n) { return n * 2; }
 function triplo(n) { return n * 3; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:108:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
+  if (numeros.length !== 0) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: Array vazio не possui mediana.

[Killed] ConditionalExpression
src/operacoes.js:108:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
+  if (false) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes medianaArray deve lançar erro para array vazio
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] MethodExpression
src/operacoes.js:109:18
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros];
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas medianaArray deve funcionar corretamente com arrays fora de ordem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrowFunction
src/operacoes.js:109:36
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
-  const sorted = [...numeros].sort((a, b) => a - b);
+  const sorted = [...numeros].sort(() => undefined);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas medianaArray deve funcionar corretamente com arrays fora de ordem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArithmeticOperator
src/operacoes.js:110:26
 function medianaArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
-  const mid = Math.floor(sorted.length / 2);
+  const mid = Math.floor(sorted.length * 2);
   if (sorted.length % 2 === 0) {
     return (sorted[mid - 1] + sorted[mid]) / 2;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:111:7
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
+  if (sorted.length % 2 !== 0) {
     return (sorted[mid - 1] + sorted[mid]) / 2;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2.5

[Killed] ConditionalExpression
src/operacoes.js:111:7
   if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
-  if (sorted.length % 2 === 0) {
+  if (true) {
     return (sorted[mid - 1] + sorted[mid]) / 2;
   }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 47. deve calcular a mediana de um array ímpar e ordenado
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2.5

[Killed] ArithmeticOperator
src/operacoes.js:112:20
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
+    return (sorted[mid + 1] + sorted[mid]) / 2;
   }
   return sorted[mid];
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes medianaArray deve retornar média correta para array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 7

[Killed] ArithmeticOperator
src/operacoes.js:112:12
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
   if (sorted.length % 2 === 0) {
-    return (sorted[mid - 1] + sorted[mid]) / 2;
+    return (sorted[mid - 1] + sorted[mid]) * 2;
   }
   return sorted[mid];
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas Casos adicionais para matar mutantes medianaArray deve retornar média correta para array par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 20

[Killed] BlockStatement
src/operacoes.js:116:19
   }
   return sorted[mid];
 }
-function dobro(n) { return n * 2; }
+function dobro(n) {}
 function triplo(n) { return n * 3; }
 function metade(n) { return n / 2; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 48. deve calcular o dobro de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:116:28
   }
   return sorted[mid];
 }
-function dobro(n) { return n * 2; }
+function dobro(n) { return n / 2; }
 function triplo(n) { return n * 3; }
 function metade(n) { return n / 2; }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 48. deve calcular o dobro de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] ArithmeticOperator
src/operacoes.js:117:29
   return sorted[mid];
 }
 function dobro(n) { return n * 2; }
-function triplo(n) { return n * 3; }
+function triplo(n) { return n / 3; }
 function metade(n) { return n / 2; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 49. deve calcular o triplo de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: 3.3333333333333335

[Killed] BlockStatement
src/operacoes.js:117:20
   return sorted[mid];
 }
 function dobro(n) { return n * 2; }
-function triplo(n) { return n * 3; }
+function triplo(n) {}
 function metade(n) { return n / 2; }
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 49. deve calcular o triplo de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 30
Received: undefined

[Killed] BlockStatement
src/operacoes.js:118:20
 }
 function dobro(n) { return n * 2; }
 function triplo(n) { return n * 3; }
-function metade(n) { return n / 2; }
+function metade(n) {}
 
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 50. deve calcular a metade de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] ArithmeticOperator
src/operacoes.js:118:29
 }
 function dobro(n) { return n * 2; }
 function triplo(n) { return n * 3; }
-function metade(n) { return n / 2; }
+function metade(n) { return n * 2; }
 
 
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 50. deve calcular a metade de um número
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 40

[Killed] ObjectLiteral
src/operacoes.js:122:18
 
 
 // Exportando todas as 50 funções
-module.exports = {
-  soma, subtracao, multiplicacao, divisao, potencia, raizQuadrada, restoDivisao,
-  fatorial, mediaArray, somaArray, maximoArray, minimoArray, valorAbsoluto,
-  arredondar, isPar, isImpar, calcularPorcentagem, aumentarPorcentagem,
-  diminuirPorcentagem, inverterSinal, seno, cosseno, tangente, logaritmoNatural,
-  logaritmoBase10, arredondarParaBaixo, arredondarParaCima, hipotenusa,
-  grausParaRadianos, radianosParaGraus, mdc, mmc, isPrimo, fibonacci,
-  produtoArray, clamp, isDivisivel, celsiusParaFahrenheit, fahrenheitParaCelsius,
-  inverso, areaCirculo, areaRetangulo, perimetroRetangulo, isMaiorQue,
-  isMenorQue, isEqual, medianaArray, dobro, triplo, metade
-};
+module.exports = {};
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 1. deve somar dois números positivos
statusReason: TypeError: soma is not a function
